---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LoadLinearLength
source: html/6cab8255-a0d2-2233-d2a1-924fd6c2b3e0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LoadLinearLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId LoadLinearLength { get; }
```